wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs_regs.h
/* USB configuration register */
# define USB_HS_GUSBCFG_TOCAL_Pos		0
# define USB_HS_GUSBCFG_TOCAL_Msk		((uint32_t)0x7 << USB_HS_GUSBCFG_TOCAL_Pos)
/* [RB]: the following fields are used by ST stack USB HS initialization
 * but they are NOT in the datasheet ...
 */
# define USB_HS_GUSBCFG_PHYIF_Pos		3
# define USB_HS_GUSBCFG_PHYIF_Msk		((uint32_t)1 << USB_HS_GUSBCFG_PHYIF_Pos)
# define USB_HS_GUSBCFG_UTMISEL_Pos		4
# define USB_HS_GUSBCFG_UTMISEL_Msk		((uint32_t)1 << USB_HS_GUSBCFG_UTMISEL_Pos)
# define USB_HS_GUSBCFG_FSINTF_Pos		5
# define USB_HS_GUSBCFG_FSINTF_Msk		((uint32_t)1 << USB_HS_GUSBCFG_FSINTF_Pos)
/****/
# define USB_HS_GUSBCFG_PHYSEL_Pos		6
# define USB_HS_GUSBCFG_PHYSEL_Msk		((uint32_t)1 << USB_HS_GUSBCFG_PHYSEL_Pos)
/* [RB]: the following fields are used by ST stack USB HS initialization
 * but they are NOT in the datasheet ...
 */
# define USB_HS_GUSBCFG_DDRSEL_Pos		7
# define USB_HS_GUSBCFG_DDRSEL_Msk		((uint32_t)1 << USB_HS_GUSBCFG_DDRSEL_Pos)
/****/
# define USB_HS_GUSBCFG_SRPCAP_Pos		8
# define USB_HS_GUSBCFG_SRPCAP_Msk		((uint32_t)1 << USB_HS_GUSBCFG_SRPCAP_Pos)
# define USB_HS_GUSBCFG_HNPCAP_Pos		9
# define USB_HS_GUSBCFG_HNPCAP_Msk		((uint32_t)1 << USB_HS_GUSBCFG_HNPCAP_Pos)
# define USB_HS_GUSBCFG_TRDT_Pos		10
# define USB_HS_GUSBCFG_TRDT_Msk		((uint32_t)0xf << USB_HS_GUSBCFG_TRDT_Pos)
# define USB_HS_GUSBCFG_PHYLPCS_Pos		15
# define USB_HS_GUSBCFG_PHYLPCS_Msk		((uint32_t)1 << USB_HS_GUSBCFG_PHYLPCS_Pos)
# define USB_HS_GUSBCFG_ULPIFSLS_Pos		17
# define USB_HS_GUSBCFG_ULPIFSLS_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPIFSLS_Pos)
# define USB_HS_GUSBCFG_ULPIAR_Pos		18
# define USB_HS_GUSBCFG_ULPIAR_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPIAR_Pos)
# define USB_HS_GUSBCFG_ULPICSM_Pos		19
# define USB_HS_GUSBCFG_ULPICSM_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPICSM_Pos)
# define USB_HS_GUSBCFG_ULPIEVBUSD_Pos		20
# define USB_HS_GUSBCFG_ULPIEVBUSD_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPIEVBUSD_Pos)
# define USB_HS_GUSBCFG_ULPIVBUSI_Pos		21
# define USB_HS_GUSBCFG_ULPIVBUSI_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPIVBUSI_Pos)
# define USB_HS_GUSBCFG_TSDPS_Pos		22
# define USB_HS_GUSBCFG_TSDPS_Msk		((uint32_t)1 << USB_HS_GUSBCFG_TSDPS_Pos)
# define USB_HS_GUSBCFG_PCCI_Pos		23
# define USB_HS_GUSBCFG_PCCI_Msk		((uint32_t)1 << USB_HS_GUSBCFG_PCCI_Pos)
# define USB_HS_GUSBCFG_PTCI_Pos		24
# define USB_HS_GUSBCFG_PTCI_Msk		((uint32_t)1 << USB_HS_GUSBCFG_PTCI_Pos)
# define USB_HS_GUSBCFG_ULPIIPD_Pos		25
# define USB_HS_GUSBCFG_ULPIIPD_Msk		((uint32_t)1 << USB_HS_GUSBCFG_ULPIIPD_Pos)
# define USB_HS_GUSBCFG_FHMOD_Pos		29
# define USB_HS_GUSBCFG_FHMOD_Msk		((uint32_t)1 << USB_HS_GUSBCFG_FHMOD_Pos)
# define USB_HS_GUSBCFG_FDMOD_Pos		30
# define USB_HS_GUSBCFG_FDMOD_Msk		((uint32_t)1 << USB_HS_GUSBCFG_FDMOD_Pos)
# define USB_HS_GUSBCFG_CTXPKT_Pos		31
# define USB_HS_GUSBCFG_CTXPKT_Msk		((uint32_t)1 << USB_HS_GUSBCFG_CTXPKT_Pos)

/* Reset register */
# define USB_HS_GRSTCTL_CSRST_Pos		0
# define USB_HS_GRSTCTL_CSRST_Msk		((uint32_t)1 << USB_HS_GRSTCTL_CSRST_Pos)
# define USB_HS_GRSTCTL_HSRST_Pos		1
# define USB_HS_GRSTCTL_HSRST_Msk		((uint32_t)1 << USB_HS_GRSTCTL_HSRST_Pos)
# define USB_HS_GRSTCTL_FCRST_Pos		2
# define USB_HS_GRSTCTL_FCRST_Msk		((uint32_t)1 << USB_HS_GRSTCTL_FCRST_Pos)
# define USB_HS_GRSTCTL_RXFFLSH_Pos		4
# define USB_HS_GRSTCTL_RXFFLSH_Msk		((uint32_t)1 << USB_HS_GRSTCTL_RXFFLSH_Pos)
# define USB_HS_GRSTCTL_TXFFLSH_Pos		5
# define USB_HS_GRSTCTL_TXFFLSH_Msk		((uint32_t)1 << USB_HS_GRSTCTL_TXFFLSH_Pos)
# define USB_HS_GRSTCTL_TXFNUM_Pos		6
# define USB_HS_GRSTCTL_TXFNUM_Msk		((uint32_t)0x1f << USB_HS_GRSTCTL_TXFNUM_Pos)
# define USB_HS_GRSTCTL_DMAREQ_Pos		30
# define USB_HS_GRSTCTL_DMAREQ_Msk		((uint32_t)1 << USB_HS_GRSTCTL_DMAREQ_Pos)
# define USB_HS_GRSTCTL_AHBIDL_Pos		31
# define USB_HS_GRSTCTL_AHBIDL_Msk		((uint32_t)1 << USB_HS_GRSTCTL_AHBIDL_Pos)

/* Core interrupt register */
# define USB_HS_GINTSTS_CMOD_Pos		0
# define USB_HS_GINTSTS_CMOD_Msk		((uint32_t)1 << USB_HS_GINTSTS_CMOD_Pos)
# define USB_HS_GINTSTS_MMIS_Pos		1
# define USB_HS_GINTSTS_MMIS_Msk		((uint32_t)1 << USB_HS_GINTSTS_MMIS_Pos)
# define USB_HS_GINTSTS_OTGINT_Pos		2
# define USB_HS_GINTSTS_OTGINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_OTGINT_Pos)
# define USB_HS_GINTSTS_SOF_Pos			3
# define USB_HS_GINTSTS_SOF_Msk			((uint32_t)1 << USB_HS_GINTSTS_SOF_Pos)
# define USB_HS_GINTSTS_RXFLVL_Pos		4
# define USB_HS_GINTSTS_RXFLVL_Msk		((uint32_t)1 << USB_HS_GINTSTS_RXFLVL_Pos)
# define USB_HS_GINTSTS_NPTXFE_Pos		5
# define USB_HS_GINTSTS_NPTXFE_Msk		((uint32_t)1 << USB_HS_GINTSTS_NPTXFE_Pos)
# define USB_HS_GINTSTS_GINAKEFF_Pos		6
# define USB_HS_GINTSTS_GINAKEFF_Msk		((uint32_t)1 << USB_HS_GINTSTS_GINAKEFF_Pos)
# define USB_HS_GINTSTS_GOUTNAKEFF_Pos		7
# define USB_HS_GINTSTS_GOUTNAKEFF_Msk		((uint32_t)1 << USB_HS_GINTSTS_GOUTNAKEFF_Pos)
# define USB_HS_GINTSTS_ESUSP_Pos		10
# define USB_HS_GINTSTS_ESUSP_Msk		((uint32_t)1 << USB_HS_GINTSTS_ESUSP_Pos)
# define USB_HS_GINTSTS_USBSUSP_Pos		11
# define USB_HS_GINTSTS_USBSUSP_Msk		((uint32_t)1 << USB_HS_GINTSTS_USBSUSP_Pos)
# define USB_HS_GINTSTS_USBRST_Pos		12
# define USB_HS_GINTSTS_USBRST_Msk		((uint32_t)1 << USB_HS_GINTSTS_USBRST_Pos)
# define USB_HS_GINTSTS_ENUMDNE_Pos		13
# define USB_HS_GINTSTS_ENUMDNE_Msk		((uint32_t)1 << USB_HS_GINTSTS_ENUMDNE_Pos)
# define USB_HS_GINTSTS_ISOODRP_Pos		14
# define USB_HS_GINTSTS_ISOODRP_Msk		((uint32_t)1 << USB_HS_GINTSTS_ISOODRP_Pos)
# define USB_HS_GINTSTS_EOPF_Pos		15
# define USB_HS_GINTSTS_EOPF_Msk		((uint32_t)1 << USB_HS_GINTSTS_EOPF_Pos)
# define USB_HS_GINTSTS_EPMISM_Pos       	17
# define USB_HS_GINTSTS_EPMISM_Msk       	((uint32_t)1 << USB_FS_GINTSTS_EPMISM_Pos)
# define USB_HS_GINTSTS_IEPINT_Pos		18
# define USB_HS_GINTSTS_IEPINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_IEPINT_Pos)
# define USB_HS_GINTSTS_OEPINT_Pos		19
# define USB_HS_GINTSTS_OEPINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_OEPINT_Pos)
# define USB_HS_GINTSTS_IISOIXFR_Pos		20
# define USB_HS_GINTSTS_IISOIXFR_Msk		((uint32_t)1 << USB_HS_GINTSTS_IISOIXFR_Pos)
# define USB_HS_GINTSTS_IPXFR_Pos		21
# define USB_HS_GINTSTS_IPXFR_Msk		((uint32_t)1 << USB_HS_GINTSTS_IPXFR_Pos)
# define USB_HS_GINTSTS_DATAFSUSP_Pos		22
# define USB_HS_GINTSTS_DATAFSUSP_Msk		((uint32_t)1 << USB_HS_GINTSTS_DATAFSUSP_Pos)
# define USB_HS_GINTSTS_HPRTINT_Pos		24
# define USB_HS_GINTSTS_HPRTINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_HPRTINT_Pos)
# define USB_HS_GINTSTS_HCINT_Pos		25
# define USB_HS_GINTSTS_HCINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_HCINT_Pos)
# define USB_HS_GINTSTS_PTXFE_Pos		26
# define USB_HS_GINTSTS_PTXFE_Msk		((uint32_t)1 << USB_HS_GINTSTS_PTXFE_Pos)
# define USB_HS_GINTSTS_CIDSCHG_Pos		28
# define USB_HS_GINTSTS_CIDSCHG_Msk		((uint32_t)1 << USB_HS_GINTSTS_CIDSCHG_Pos)
# define USB_HS_GINTSTS_DISCINT_Pos		29
# define USB_HS_GINTSTS_DISCINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_DISCINT_Pos)
# define USB_HS_GINTSTS_SRQINT_Pos		30
# define USB_HS_GINTSTS_SRQINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_SRQINT_Pos)
# define USB_HS_GINTSTS_WKUPINT_Pos		31
# define USB_HS_GINTSTS_WKUPINT_Msk		((uint32_t)1 << USB_HS_GINTSTS_WKUPINT_Pos)

/* Interrupt mask register */
# define USB_HS_GINTMSK_MMISM_Pos		1
# define USB_HS_GINTMSK_MMISM_Msk		((uint32_t)1 << USB_HS_GINTMSK_MMISM_Pos)
# define USB_HS_GINTMSK_OTGINT_Pos		2
# define USB_HS_GINTMSK_OTGINT_Msk		((uint32_t)1 << USB_HS_GINTMSK_OTGINT_Pos)
# define USB_HS_GINTMSK_SOFM_Pos		3
# define USB_HS_GINTMSK_SOFM_Msk		((uint32_t)1 << USB_HS_GINTMSK_SOFM_Pos)
# define USB_HS_GINTMSK_RXFLVLM_Pos		4
# define USB_HS_GINTMSK_RXFLVLM_Msk		((uint32_t)1 << USB_HS_GINTMSK_RXFLVLM_Pos)
# define USB_HS_GINTMSK_NPTXFEM_Pos		5
# define USB_HS_GINTMSK_NPTXFEM_Msk		((uint32_t)1 << USB_HS_GINTMSK_NPTXFEM_Pos)
# define USB_HS_GINTMSK_GINAKEFFM_Pos		6
# define USB_HS_GINTMSK_GINAKEFFM_Msk		((uint32_t)1 << USB_HS_GINTMSK_GINAKEFFM_Pos)
# define USB_HS_GINTMSK_GOUTNAKEFFM_Pos		7
# define USB_HS_GINTMSK_GOUTNAKEFFM_Msk		((uint32_t)1 << USB_HS_GINTMSK_GOUTNAKEFFM_Pos)
# define USB_HS_GINTMSK_ESUSPM_Pos		10
# define USB_HS_GINTMSK_ESUSPM_Msk		((uint32_t)1 << USB_HS_GINTMSK_ESUSPM_Pos)
# define USB_HS_GINTMSK_USBSUSPM_Pos		11
# define USB_HS_GINTMSK_USBSUSPM_Msk		((uint32_t)1 << USB_HS_GINTMSK_USBSUSPM_Pos)
# define USB_HS_GINTMSK_USBRST_Pos		12
# define USB_HS_GINTMSK_USBRST_Msk		((uint32_t)1 << USB_HS_GINTMSK_USBRST_Pos)
# define USB_HS_GINTMSK_ENUMDNEM_Pos		13
# define USB_HS_GINTMSK_ENUMDNEM_Msk		((uint32_t)1 << USB_HS_GINTMSK_ENUMDNEM_Pos)
# define USB_HS_GINTMSK_ISOODRPM_Pos		14
# define USB_HS_GINTMSK_ISOODRPM_Msk		((uint32_t)1 << USB_HS_GINTMSK_ISOODRPM_Pos)
# define USB_HS_GINTMSK_EOPFM_Pos		15
# define USB_HS_GINTMSK_EOPFM_Msk		((uint32_t)1 << USB_HS_GINTMSK_EOPFM_Pos)
# define USB_HS_GINTMSK_EPMISM_Pos		17
# define USB_HS_GINTMSK_EPMISM_Msk		((uint32_t)1 << USB_HS_GINTMSK_EPMISM_Pos)
# define USB_HS_GINTMSK_IEPINT_Pos		18
# define USB_HS_GINTMSK_IEPINT_Msk		((uint32_t)1 << USB_HS_GINTMSK_IEPINT_Pos)
# define USB_HS_GINTMSK_OEPINT_Pos		19
# define USB_HS_GINTMSK_OEPINT_Msk		((uint32_t)1 << USB_HS_GINTMSK_OEPINT_Pos)
# define USB_HS_GINTMSK_IISOIXFRM_Pos		20
# define USB_HS_GINTMSK_IISOIXFRM_Msk		((uint32_t)1 << USB_HS_GINTMSK_IISOIXFRM_Pos)
# define USB_HS_GINTMSK_IISOOXFRM_Pos		21
# define USB_HS_GINTMSK_IISOOXFRM_Msk		((uint32_t)1 << USB_HS_GINTMSK_IISOOXFRM_Pos)
# define USB_HS_GINTMSK_FSUSPM_Pos		22
# define USB_HS_GINTMSK_FSUSPM_Msk		((uint32_t)1 << USB_HS_GINTMSK_FSUSPM_Pos)
# define USB_HS_GINTMSK_PRTIM_Pos		24
# define USB_HS_GINTMSK_PRTIM_Msk		((uint32_t)1 << USB_HS_GINTMSK_PRTIM_Pos)
# define USB_HS_GINTMSK_HCIM_Pos		25
# define USB_HS_GINTMSK_HCIM_Msk		((uint32_t)1 << USB_HS_GINTMSK_HCIM_Pos)
# define USB_HS_GINTMSK_PTXFEM_Pos		26
# define USB_HS_GINTMSK_PTXFEM_Msk		((uint32_t)1 << USB_HS_GINTMSK_PTXFEM_Pos)
# define USB_HS_GINTMSK_CIDSCHGM_Pos		28
# define USB_HS_GINTMSK_CIDSCHGM_Msk		((uint32_t)1 << USB_HS_GINTMSK_CIDSCHGM_Pos)
# define USB_HS_GINTMSK_DISCINT_Pos		29
# define USB_HS_GINTMSK_DISCINT_Msk		((uint32_t)1 << USB_HS_GINTMSK_DISCINT_Pos)
# define USB_HS_GINTMSK_SRQIM_Pos		30
# define USB_HS_GINTMSK_SRQIM_Msk		((uint32_t)1 << USB_HS_GINTMSK_SRQIM_Pos)
# define USB_HS_GINTMSK_WUIM_Pos		31
# define USB_HS_GINTMSK_WUIM_Msk		((uint32_t)1 << USB_HS_GINTMSK_WUIM_Pos)

/* Receive status debug read/pop registers */
# define USB_HS_GRXSTSR_EPNUM_Pos		0
# define USB_HS_GRXSTSR_EPNUM_Msk		((uint32_t)0xf << USB_HS_GRXSTSR_EPNUM_Pos)
# define USB_HS_GRXSTSR_BCNT_Pos		4
# define USB_HS_GRXSTSR_BCNT_Msk		((uint32_t)0x7ff << USB_HS_GRXSTSR_BCNT_Pos)
# define USB_HS_GRXSTSR_DPID_Pos		15
# define USB_HS_GRXSTSR_DPID_Msk		((uint32_t)0x3 << USB_HS_GRXSTSR_DPID_Pos)
# define USB_HS_GRXSTSR_PKTSTS_Pos		17
# define USB_HS_GRXSTSR_PKTSTS_Msk		((uint32_t)0xf << USB_HS_GRXSTSR_PKTSTS_Pos)
#	define USB_HS_GRXSTSR_PKTSTS_GLOBAL_OUT_NAK		1
#	define USB_HS_GRXSTSR_PKTSTS_OUT_DATA			2
#	define USB_HS_GRXSTSR_PKTSTS_OUT_TRANFER_COMPLETE	3
#	define USB_HS_GRXSTSR_PKTSTS_SETUP_TRANSACTION_COMPLETE	4
#	define USB_HS_GRXSTSR_PKTSTS_SETUP_DATA			6
# define USB_HS_GRXSTSR_FRMNUM_Pos		21
# define USB_HS_GRXSTSR_FRMNUM_Msk		((uint32_t)0x7f << USB_HS_GRXSTSR_FRMNUM_Pos)

/* Receive FIFO size register */
# define USB_HS_GRXFSIZ_RXFD_Pos		0
# define USB_HS_GRXFSIZ_RXFD_Msk		((uint32_t)0xffff << USB_HS_GRXFSIZ_RXFD_Pos)

