wookey-project/driver-stm32f4xx-usb/stm32f4xx_usb_hs_regs.h
/* Device endpoint interrupt register */
# define USB_HS_DIEPINT_XFRC_Pos		0
# define USB_HS_DIEPINT_XFRC_Msk		((uint32_t)1 << USB_HS_DIEPINT_XFRC_Pos)
# define USB_HS_DIEPINT_EPDISD_Pos		1
# define USB_HS_DIEPINT_EPDISD_Msk		((uint32_t)1 << USB_HS_DIEPINT_TOC_Pos)
# define USB_HS_DIEPINT_TOC_Pos			3
# define USB_HS_DIEPINT_TOC_Msk			((uint32_t)1 << USB_HS_DIEPINT_TOC_Pos)
# define USB_HS_DIEPINT_ITTXFE_Pos		4
# define USB_HS_DIEPINT_ITTXFE_Msk		((uint32_t)1 << USB_HS_DIEPINT_ITTXFE_Pos)
# define USB_HS_DIEPINT_INEPNE_Pos		6
# define USB_HS_DIEPINT_INEPNE_Msk		((uint32_t)1 << USB_HS_DIEPINT_INEPNE_Pos)
# define USB_HS_DIEPINT_TXFE_Pos		7
# define USB_HS_DIEPINT_TXFE_Msk		((uint32_t)1 << USB_HS_DIEPINT_TXFE_Pos)
# define USB_HS_DIEPINT_TXFIFOUDRN_Pos		8
# define USB_HS_DIEPINT_TXFIFOUDRN_Msk		((uint32_t)1 << USB_HS_DIEPINT_TXFIFOUDRN_Pos)
# define USB_HS_DIEPINT_BNA_Pos			9
# define USB_HS_DIEPINT_BNA_Msk			((uint32_t)1 << USB_HS_DIEPINT_BNA_Pos)
# define USB_HS_DIEPINT_PKTDRPSTS_Pos		11
# define USB_HS_DIEPINT_PKTDRPSTS_Msk		((uint32_t)1 << USB_HS_DIEPINT_PKTDRPSTS_Pos)
# define USB_HS_DIEPINT_BERR_Pos		12
# define USB_HS_DIEPINT_BERR_Msk		((uint32_t)1 << USB_HS_DIEPINT_BERR_Pos)
# define USB_HS_DIEPINT_NAK_Pos			13
# define USB_HS_DIEPINT_NAK_Msk			((uint32_t)1 << USB_HS_DIEPINT_NAK_Pos)

/* Device IN endpoint X transfert size register */
# define USB_HS_DIEPTSIZ_XFRSIZ_Pos(EP)		0
# define USB_HS_DIEPTSIZ_XFRSIZ_Msk(EP)		((EP) > 0 ? ((uint32_t)0x7ffff << USB_HS_DIEPTSIZ_XFRSIZ_Pos(EP)) \
						: ((uint32_t)0x7f << USB_HS_DIEPTSIZ_XFRSIZ_Pos(EP)))
# define USB_HS_DIEPTSIZ_PKTCNT_Pos(EP)		19
# define USB_HS_DIEPTSIZ_PKTCNT_Msk(EP)		((EP) > 0 ? ((uint32_t)0x3ff << USB_HS_DIEPTSIZ_PKTCNT_Pos(EP)) \
						: ((uint32_t)0x3 << USB_HS_DIEPTSIZ_PKTCNT_Pos(EP)))
# define USB_HS_DIEPTSIZ_MCNT_Pos(EP)		29
# define USB_HS_DIEPTSIZ_MCNT_Msk(EP)		((EP) > 0 ? ((uint32_t)0x3 << USB_HS_DIEPTSIZ_MCNT_Pos(EP)) : 0)

/* Device EPx DMA address register */
# define USB_HS_DIEPDMA_DMAADDR_Pos		0
# define USB_HS_DIEPDMA_DMAADDR_Msk		((uint32_t)0xffffffff << USB_HS_DIEPDMA_DMAADDR_Pos)

/* Device IN endpoint transmit FIFO status register */
# define USB_HS_DTXFSTS_INEPTFSAV_Pos		0
# define USB_HS_DTXFSTS_INEPTFSAV_Msk		((uint32_t)0xffff << USB_HS_DTXFSTS_INEPTFSAV_Pos)

/* Device control OUT endpoint X control register */
# define USB_HS_DOEPCTL_MPSIZ_Pos(EP)		0
# define USB_HS_DOEPCTL_MPSIZ_Msk(EP)		((EP) > 0 ? ((uint32_t)0x7ff << USB_HS_DOEPCTL_MPSIZ_Pos(EP)) \
						: ((uint32_t)0x3 << USB_HS_DOEPCTL_MPSIZ_Pos(EP)))
# define USB_HS_DOEPCTL_USBAEP_Pos		15
# define USB_HS_DOEPCTL_USBAEP_Msk		((uint32_t)1 << USB_HS_DOEPCTL_USBAEP_Pos)
# define USB_HS_DOEPCTL_EONUM_Pos(EP)		16
# define USB_HS_DOEPCTL_EONUM_Msk(EP)		((EP) > 0 ? ((uint32_t)1 << USB_HS_DOEPCTL_USBAEP_Pos(EP)) : 0)
# define USB_HS_DOEPCTL_NAKSTS_Pos		17
# define USB_HS_DOEPCTL_NAKSTS_Msk		((uint32_t)1 << USB_HS_DOEPCTL_NAKSTS_Pos)
# define USB_HS_DOEPCTL_EPTYP_Pos		18
# define USB_HS_DOEPCTL_EPTYP_Msk		((uint32_t)0x3 << USB_HS_DOEPCTL_EPTYP_Pos)
#	define USB_HS_DOEPCTL_EPTYP_CONTROL	0
#	define USB_HS_DOEPCTL_EPTYP_ISOCHRO	1
#	define USB_HS_DOEPCTL_EPTYP_BULK	2
#	define USB_HS_DOEPCTL_EPTYP_INT		3
# define USB_HS_DOEPCTL_SNPM_Pos		20
# define USB_HS_DOEPCTL_SNPM_Msk		((uint32_t)1 << USB_HS_DOEPCTL_SNPM_Pos)
# define USB_HS_DOEPCTL_STALL_Pos		21
# define USB_HS_DOEPCTL_STALL_Msk		((uint32_t)1 << USB_HS_DOEPCTL_STALL_Pos)
# define USB_HS_DOEPCTL_CNAK_Pos		26
# define USB_HS_DOEPCTL_CNAK_Msk		((uint32_t)1 << USB_HS_DOEPCTL_CNAK_Pos)
# define USB_HS_DOEPCTL_SNAK_Pos		27
# define USB_HS_DOEPCTL_SNAK_Msk		((uint32_t)1 << USB_HS_DOEPCTL_SNAK_Pos)
# define USB_HS_DOEPCTL_SD0PID_Pos   		28
# define USB_HS_DOEPCTL_SD0PID_Msk   		((uint32_t)1 << USB_HS_DOEPCTL_SD0PID_Pos)
# define USB_HS_DOEPCTL_SD1PID_Pos   		29
# define USB_HS_DOEPCTL_SD1PID_Msk   		((uint32_t)1 << USB_HS_DOEPCTL_SD1PID_Pos)
#if 0
# define USB_HS_DOEPCTL_SD0PID_Pos(EP)		28 /* Applies to interrupt/bulk OUT EP */
# define USB_HS_DOEPCTL_SD0PID_Msk(EP)		((EP) > 0 ? ((uint32_t)1 << USB_HS_DOEPCTL_SD0PID_Pos(EP)) : 0)
# define USB_HS_DOEPCTL_SEVNFRM_Pos(EP)		28 /* Applies to isochronous OUT EP */
# define USB_HS_DOEPCTL_SEVNFRM_Msk(EP)		((EP) > 0 ? ((uint32_t)1 << USB_HS_DOEPCTL_SEVNFRM_Pos(EP)) : 0)
# define USB_HS_DOEPCTL_SD1PID_Pos(EP)		29 /* Applies to interrupt/bulk OUT EP */
# define USB_HS_DOEPCTL_SD1PID_Msk(EP)		((EP) > 0 ? ((uint32_t)1 << USB_HS_DOEPCTL_SD1PID_Pos(EP)) : 0)
# define USB_HS_DOEPCTL_SODDFRM_Pos(EP)		29
# define USB_HS_DOEPCTL_SODDFRM_Msk(EP)		((EP) > 0 ? ((uint32_t)1 << USB_HS_DOEPCTL_SODDFRM_Pos(EP)) : 0)
#endif
# define USB_HS_DOEPCTL_EPDIS_Pos		30
# define USB_HS_DOEPCTL_EPDIS_Msk		((uint32_t)1 << USB_HS_DOEPCTL_EPDIS_Pos)
# define USB_HS_DOEPCTL_EPENA_Pos		31
# define USB_HS_DOEPCTL_EPENA_Msk		((uint32_t)1 << USB_HS_DOEPCTL_EPENA_Pos)

/* Device endpoint interrupt register */
# define USB_HS_DOEPINT_XFRC_Pos		0
# define USB_HS_DOEPINT_XFRC_Msk		((uint32_t)1 << USB_HS_DOEPINT_XFRC_Pos)
# define USB_HS_DOEPINT_EPDISD_Pos		1
# define USB_HS_DOEPINT_EPDISD_Msk		((uint32_t)1 << USB_HS_DOEPINT_EPDISD_Pos)
# define USB_HS_DOEPINT_STUP_Pos		3
# define USB_HS_DOEPINT_STUP_Msk		((uint32_t)1 << USB_HS_DOEPINT_STUP_Pos)
# define USB_HS_DOEPINT_OTEPDIS_Pos		4
# define USB_HS_DOEPINT_OTEPDIS_Msk		((uint32_t)1 << USB_HS_DOEPINT_OTEPDIS_Pos)
# define USB_HS_DOEPINT_B2BSTUP_Pos		6
# define USB_HS_DOEPINT_B2BSTUP_Msk		((uint32_t)1 << USB_HS_DOEPINT_B2BSTUP_Pos)
# define USB_HS_DOEPINT_NYET_Pos		14
# define USB_HS_DOEPINT_NYET_Msk		((uint32_t)1 << USB_HS_DOEPINT_NYET_Pos)

/* Device OUT enpoint 0 transfer size register */
# define USB_HS_DOEPTSIZ_XFRSIZ_Pos(EP)		0
# define USB_HS_DOEPTSIZ_XFRSIZ_Msk(EP)		((EP) > 0 ? ((uint32_t)0x7ffff << USB_HS_DOEPTSIZ_XFRSIZ_Pos(EP)) \
						: ((uint32_t)0x7f << USB_HS_DOEPTSIZ_XFRSIZ_Pos(EP)))
# define USB_HS_DOEPTSIZ_PKTCNT_Pos(EP)		19
# define USB_HS_DOEPTSIZ_PKTCNT_Msk(EP)		((EP) > 0 ? ((uint32_t)0x3ff << USB_HS_DOEPTSIZ_PKTCNT_Pos(EP)) \
						: ((uint32_t)1 << USB_HS_DOEPTSIZ_PKTCNT_Pos(EP)))
# define USB_HS_DOEPTSIZ_STUPCNT_Pos		29 /* Applies to control OUT EP */
# define USB_HS_DOEPTSIZ_STUPCNT_Msk		((uint32_t)3 << USB_HS_DOEPTSIZ_STUPCNT_Pos)
# define USB_HS_DOEPTSIZ_RXDPID_Pos		29 /* Applies to isochronous OUT EP */
# define USB_HS_DOEPTSIZ_RXDPID_Msk		((uint32_t)3 << USB_HS_DOEPTSIZ_RXDPID_Pos)

/* Device EPx DMA address register */
# define USB_HS_DOEPDMA_DMAADDR_Pos		0
# define USB_HS_DOEPDMA_DMAADDR_Msk		((uint32_t)0xffffffff << USB_HS_DOEPDMA_DMAADDR_Pos)

/* Power and clock gating control register */
# define USB_HS_PCGCCTL_STPPCLK_Pos		0
# define USB_HS_PCGCCTL_STPPCLK_Msk		((uint32_t)1 << USB_HS_PCGCCTL_STPPCLK_Pos)
# define USB_HS_PCGCCTL_GATEHCLK_Pos		1
# define USB_HS_PCGCCTL_GATEHCLK_Msk		((uint32_t)1 << USB_HS_PCGCCTL_GATEHCLK_Pos)
# define USB_HS_PCGCCTL_PHYSUSP_Pos		4
# define USB_HS_PCGCCTL_PHYSUSP_Msk		((uint32_t)1 << USB_HS_PCGCCTL_PHYSUSP_Pos)

/* GPIO definitions for ULPI Mode */
# define GPIO_AF10_OTG_HS      10
/* GPIO A */
# define ULPI_D0_PIN           3
# define ULPI_CLK_PIN          5
/* GPIO B */
# define ULPI_D1_PIN           0
# define ULPI_D2_PIN           1
# define ULPI_D7_PIN           5
# define ULPI_D3_PIN           10
# define ULPI_D4_PIN           11
# define ULPI_D5_PIN           12
# define ULPI_D6_PIN           13
/* GPIO C */
# define ULPI_STP_PIN          0
# define ULPI_DIR_PIN          2
# define ULPI_NXT_PIN          3

#endif /* STM32F4XX_USB_HS_REGS_H */
